var survey = [
    {
        text: "政府派錢六千蚊，你會搜尋廉價機票，盤算怎麼花",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 0
    },
    {
        text: "公司需要你加班並且給額外人工，不過你更樂意參加約好的聚會",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 1
    },
    {
        text: "你會在畢業前提前進行長遠的職業規劃",
        options: [
            ["很同意", 0],
            ["較同意", 1],
            ["較反對", 3],
            ["很反對", 5]
        ],
        serial: 2
    },
    {
        text: "你覺得抽居屋和買私樓的機會不屬於你，所以你會輪公屋",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 3
    },
    {
        text: "比起李嘉誠，你更欣賞王維基",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 4
    },
    {
        text: "你認爲社會上成功的青年其實是「靠父幹」",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 5
    },
    {
        text: "長輩指責你「hea」、「頹」、不思進取，你不會太在意",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 6
    },
    {
        text: "無論他人怎樣評價你，都不會改變你對自己的認識",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 7
    },
    {
        text: "你認爲建制勢力對社會具有意義",
        options: [
            ["很同意", 0],
            ["較同意", 1],
            ["較反對", 3],
            ["很反對", 5]
        ],
        serial: 8
    },
    {
        text: "當你不理父母長輩勸說，遵循自己標準做事，會感到自豪",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 9
    },
    {
        text: "你覺得社會公義比個人追求更重要",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 10
    },
    {
        text: "你會爲了堅守自己的準則，而寧可和親友持不同立場",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 11
    },
    {
        text: "當要爲社會公義發聲時，你覺得游行、集會比辯論更直接有效",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 12
    },
    {
        text: "相比起報刊、雜誌、書本，你更喜歡從網絡獲取知識",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 13
    },
    {
        text: "你覺得傳統已經過時, 需要在短時間內發生徹底變革",
        options: [
            ["很同意", 5],
            ["較同意", 3],
            ["較反對", 1],
            ["很反對", 0]
        ],
        serial: 14
    },
];


var additionalQuestions = [
    {
        text: "你覺得自己是[廢青]",
        options: [
            ["是", 0],
            ["否", 0],
        ],
        serial: 1000
    },
    {
        text: "你試過被人說是[廢青]",
        options: [
            ["是", 0],
            ["否", 0],
        ],
        serial: 2000
    }

];
